Revit 2024 API
WireTypeSet.Contains Method
Tests for the existence of a wire type within the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Contains(
	WireType item
)
Visual Basic
Public Overridable Function Contains ( _
	item As WireType _
) As Boolean
Visual C++
public:
virtual bool Contains(
	WireType^ item
)
Parameters
item
Type: Autodesk.Revit.DB.Electrical.WireType
The wire type to be searched for.
Return Value
The Contains method returns True if the wire type is within the set, otherwise False.
See Also
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace